node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "AddV2"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "normalize_element/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 334
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 334
          }
        }
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1191208.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_59731.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_391908.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_285297.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_1038087.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_247656.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_495107.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1149855.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_981708.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_450918.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_56450.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_284928.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_5650136.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_362274.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_631692.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_252217.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_83200.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_49764.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_205585.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_770353.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_842775.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_170264.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_166342.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_989230.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_36015.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_795075.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_84195.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_670826.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_128663.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_581976.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_7558720.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_533192.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_377277.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_136196.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_667363.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_8199661.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_1018327.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_132163.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_7856615.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_1078550.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_605492.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_312675.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_191503.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_438959.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_905409.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_741178.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_194723.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_49890.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_224165.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_952958.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_211386.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_236628.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_892933.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_748447.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_58086.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_144050.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_25540.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_707886.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_135389.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_8565131.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_103757.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1396181.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_432776.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_1036366.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_337094.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_152185.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_224845.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_22088.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_900498.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_195474.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_347609.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_76104.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_6095801.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_118868.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_366607.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_12870.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_482517.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_788696.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_78061.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_895194.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_626316.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_322855.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_655230.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_1056717.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_62897.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_211406.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_646878.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_5079.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_231124.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_649376.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_401863.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_148318.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_147015.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_7604243.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_527077.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_179917.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_143329.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_221789.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_764946.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_280900.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_6860600.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_178753.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_868803.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_264787.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_98310.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_664410.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_360519.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_1049830.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_1017769.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_847275.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_638521.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_76868.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_146222.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_500266.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_67102.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_773682.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_198534.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_5816638.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_7894.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_63307.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_534470.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_747970.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_233925.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_1039203.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_774566.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_400518.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_591549.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_246154.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_570384.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_177319.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_79637.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_205466.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_7370579.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_5678382.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_52610.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_994009.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_23014.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_80102.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_149787.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_486103.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_399883.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_6537196.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_896458.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_44475.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_921838.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_604222.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_234935.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_24341.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_699062.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_382276.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_225131.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_721886.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_989553.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_373039.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_8372658.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_474121.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_774689.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_12849.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_740461.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_8154154.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_430764.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1282475.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_772630.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_314919.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_342411.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_685158.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_474783.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_7387658.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_913449.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_664261.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_886726.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_97516.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_1019808.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_86502.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_83483.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_308150.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_119477.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_869358.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_135434.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_154838.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_846007.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_707067.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_164336.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_760290.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_984831.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_933610.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_849790.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_1167260.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_35915.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1111068.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_52223.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_31559.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_1029191.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_693819.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_93023.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_249079.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_605682.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_135713.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_979278.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_470303.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_233609.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_80221.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_55568.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_242570.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_1010394.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_652725.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_591317.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_275372.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_1199913.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_246718.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_511199.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_1050276.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_305760.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_1087508.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_44682.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_953791.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_70625.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_7786924.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1443339.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_831672.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_232281.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_970508.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_1095404.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_909806.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_1072277.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_956930.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_747992.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_247288.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_115033.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_761032.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_651904.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_70352.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_124834.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_653336.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_167553.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_820924.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_624341.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_1029042.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_908474.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_153941.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_43105.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_14484.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_7496.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_101973.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_168875.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_60129.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_657443.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_649970.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_943439.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_16233.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_417184.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_534068.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_246510.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_359826.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_198411.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_60373.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_120804.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_804466.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_11869.png"
        string_val: "/workspace/tao-experiments/data/images/train/Bolivia_129334.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_103447.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_2523247.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_59460.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_592446.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_271769.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_134751.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_887131.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_3285448.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_9684.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_232060.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_91379.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_81933.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_225187.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_403081.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_45911.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_19225.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_1049586.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_769408.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_806273.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_955053.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_922192.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_956740.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_716716.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_916628.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_600295.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_126224.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_828067.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_179624.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_254910.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_977338.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_54421.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_210595.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_504150.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_992457.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_6199994.png"
        string_val: "/workspace/tao-experiments/data/images/train/Spain_2938657.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_529525.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_439488.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_1033830.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_612594.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_11745.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_778194.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_308249.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_648632.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_265762.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_1068362.png"
        string_val: "/workspace/tao-experiments/data/images/train/Somalia_94102.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_866994.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1439641.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_528249.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_319168.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_922373.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_141910.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_698338.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_45934.png"
        string_val: "/workspace/tao-experiments/data/images/train/Ghana_167233.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_1068117.png"
        string_val: "/workspace/tao-experiments/data/images/train/Nigeria_31096.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_73419.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_225017.png"
        string_val: "/workspace/tao-experiments/data/images/train/Paraguay_1076204.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_260929.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_251323.png"
        string_val: "/workspace/tao-experiments/data/images/train/Pakistan_712873.png"
        string_val: "/workspace/tao-experiments/data/images/train/USA_652955.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1395593.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_1018317.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_132922.png"
        string_val: "/workspace/tao-experiments/data/images/train/Sri-Lanka_236030.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_424793.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_952728.png"
        string_val: "/workspace/tao-experiments/data/images/train/India_179238.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_293769.png"
        string_val: "/workspace/tao-experiments/data/images/train/Mekong_1413877.png"
      }
    }
  }
}
node {
  name: "normalize_element/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 334
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 334
          }
        }
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_1191208.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_59731.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_391908.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_285297.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_1038087.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_247656.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_495107.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_1149855.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_981708.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_450918.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_56450.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_284928.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_5650136.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_362274.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_631692.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_252217.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_83200.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_49764.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_205585.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_770353.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_842775.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_170264.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_166342.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_989230.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_36015.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_795075.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_84195.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_670826.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_128663.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_581976.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_7558720.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_533192.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_377277.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_136196.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Pakistan_667363.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_8199661.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_1018327.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_132163.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_7856615.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_1078550.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_605492.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_312675.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_191503.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_438959.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_905409.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_741178.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_194723.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_49890.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_224165.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Nigeria_952958.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Pakistan_211386.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_236628.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_892933.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_748447.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_58086.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_144050.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_25540.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_707886.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_135389.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_8565131.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_103757.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_1396181.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_432776.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Pakistan_1036366.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_337094.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_152185.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_224845.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Nigeria_22088.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_900498.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_195474.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_347609.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_76104.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_6095801.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_118868.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_366607.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_12870.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_482517.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_788696.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Nigeria_78061.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_895194.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_626316.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_322855.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_655230.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_1056717.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_62897.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_211406.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_646878.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_5079.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_231124.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_649376.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Pakistan_401863.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_148318.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_147015.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_7604243.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_527077.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_179917.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Nigeria_143329.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_221789.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_764946.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_280900.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_6860600.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_178753.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_868803.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_264787.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_98310.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_664410.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_360519.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_1049830.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_1017769.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_847275.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_638521.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_76868.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_146222.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_500266.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_67102.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_773682.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_198534.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_5816638.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_7894.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_63307.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_534470.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_747970.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_233925.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_1039203.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_774566.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Sri-Lanka_400518.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_591549.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_246154.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_570384.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_177319.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_79637.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_205466.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_7370579.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_5678382.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_52610.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_994009.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_23014.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_80102.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_149787.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_486103.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_399883.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_6537196.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_896458.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_44475.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_921838.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_604222.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_234935.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_24341.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_699062.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_382276.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Nigeria_225131.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_721886.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_989553.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_373039.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_8372658.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Pakistan_474121.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_774689.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_12849.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Pakistan_740461.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_8154154.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_430764.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_1282475.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_772630.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Bolivia_314919.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_342411.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_685158.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_474783.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Spain_7387658.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_913449.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_664261.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Somalia_886726.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_97516.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Paraguay_1019808.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_86502.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_83483.png"
        string_val: "/workspace/tao-experiments/data/masks/train/USA_308150.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Mekong_119477.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_869358.png"
        string_val: "/workspace/tao-experiments/data/masks/train/India_135434.png"
        string_val: "/workspace/tao-experiments/data/masks/train/Ghana_154838.png"
